Repository: bipulkumar7/DebianInstaller
Catalog: manual/po/*/install-methods.po
Languages: da

source: Run <command>Disk Copy</command>, and select <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, then select the <emphasis>locked</emphasis> image file from the resulting dialog. It will ask you to insert a floppy, then ask if you really want to erase it. When done it should eject the floppy.
da: Kør <command>Disk Copy</command>, og vælg <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, vælg så den <emphasis>låste</emphasis> billedfil fra resultatdialogen. Den vil bede dig om at indsætte en diskette og om du er sikker på at du ønsker at slette den. Når færdig bør disketten blive skubbet ud.

source: Writing Disk Images with <command>suntar</command>
da: Skrivning af diskaftryk med <command>suntar</command>

source: Obtain <command>suntar</command> from <ulink url="&url-powerpc-suntar;"> </ulink>. Start the <command>suntar</command> program and select <quote>Overwrite Sectors...</quote> from the <userinput>Special</userinput> menu.
da: Hent <command>suntar</command> fra <ulink url="&url-powerpc-suntar;"> </ulink>. Start programmet <command>suntar</command> og vælg <quote>Overskriv sektorer ...</quote> fra menuen <userinput>Special</userinput>.

source: Insert the floppy disk as requested, then hit &enterkey; (start at sector 0).
da: Indsæt diskettedisken som anmodt om og tryk på &enterkey; (start ved sektor 0).

source: Select the <filename>root.bin</filename> file in the file-opening dialog.
da: Vælg filen <filename>root.bin</filename> i filåbningsdialogen.

source: After the floppy has been created successfully, select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. If there are any errors writing the floppy, simply toss that floppy and try another.
da: Efter disketten er blevet oprettet vælges <menuchoice> <guimenu>Fil</guimenu> <guimenuitem>Skub ud</guimenuitem> </menuchoice>. Hvis der opstod fejl ved skrivning af disketten, så smid den ud og prøv på en anden.

source: Before using the floppy you created, <emphasis>set the write protect tab</emphasis>! Otherwise if you accidentally mount it in MacOS, MacOS will helpfully ruin it.
da: Før du bruger disketten du oprettede, <emphasis>så husk at slå skrivebeskyttelsen til</emphasis>! Ellers vil MacOS, hvis du ved en fejltagelse monterer den, gøre disketten ubrugelig til sit formål.

source: Preparing Files for USB Memory Stick Booting
da: Forberedning af filer for opstart via USB-hukommelsesdrev

source: To prepare the USB stick, you will need a system where GNU/Linux is already running and where USB is supported. With current GNU/Linux systems the USB stick should be automatically recognized when you insert it. If it is not you should check that the usb-storage kernel module is loaded. When the USB stick is inserted, it will be mapped to a device named <filename>/dev/sdX</filename>, where the <quote>X</quote> is a letter in the range a-z. You should be able to see to which device the USB stick was mapped by running the command <command>dmesg</command> after inserting it. To write to your stick, you may have to turn off its write protection switch.
da: For at forberede USB-drevet, så skal du bruge et system hvor GNU/Linux allerede er installeret og hvor USB er understøttet. Med nuværende GNU/Linux-systemer vil USB-drevet automatisk blive genkendt når det indsættes. Hvis ikke bør du kontrollere om usb-storage-kernemodulet er indlæst. Når USB-drevet indsættes, så vil det blive lagt på en enhed navngivet <filename>/dev/sdX</filename>, hvor <quote>X</quote> er et bogstav i intervallet a-z. Du bør kunne se hvilken enhd USB-drevet blev lagt på ved at køre kommandoen <command>dmesg</command> efter indsættelse. For at skrive til dit drev skal du måske stille på skrivebeskyttelsesknappen.

source: The procedures described in this section will destroy anything already on the device! Make very sure that you use the correct device name for your USB stick. If you use the wrong device the result could be that all information on for example a hard disk could be lost.
da: Procedurerne beskrevet i dette afsnit vil fjerne alt på enheden! Vær sikker på at du bruger det korrekt enhedsnavn for dit USB-drev. Hvis du bruger dne forkerte enhed kan resultatet være at al information på for eksempel en harddisk mistes.

source: Preparing a USB stick using a hybrid CD or DVD image
da: Forberedning af et USB-drev via en hybrid cd eller et dvd-aftryk

source: Debian CD and DVD images can now be written directly to a USB stick, which is a very easy way to make a bootable USB stick. Simply choose a CD or DVD image (such as the netinst, CD-1, DVD-1, or netboot) that will fit on your USB stick. See <xref linkend="official-cdrom"/> to get a CD or DVD image.
da: Debian cd- og dvd-aftryk kan nu skrives direkte på et USB-drev, hvilket er en meget nem måde at lave et USB-drev, der kan opstartes fra. Vælg et cd- eller dvd-aftryk (såsom netinst, cd-1, dvd-1 eller netboot), som vil passe på dit USB-drev. Se <xref linkend="official-cdrom"/> for hvordan du får fat i et cd- eller dvd-aftryk.

source: Alternatively, for very small USB sticks, only a few megabytes in size, you can download the <filename>mini.iso</filename> image from the <filename>netboot</filename> directory (at the location mentioned in <xref linkend="where-files"/>).
da: Alternativt kan du for meget små USB-drev på kun nogle få megabyte hente aftrykket <filename>mini.iso</filename> fra mappen <filename>netboot</filename> (på placeringen nævnt i <xref linkend="where-files"/>).

source: The CD or DVD image you choose should be written directly to the USB stick, overwriting its current contents. For example, when using an existing GNU/Linux system, the CD or DVD image file can be written to a USB stick as follows, after having made sure that the stick is unmounted: <informalexample><screen> <prompt>#</prompt> <userinput>cp <replaceable>debian.iso</replaceable> /dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> The <ulink url="http://sf.net/projects/win32diskimager/"> win32diskimager</ulink> utility can be used under other operating systems to copy the image.
da: Cd eller dvd-aftrykket du vælger skal skrives direkte til USB-drevet, og overskrive dets nuværende indhold. For eksempel kan du med et eksisterende GNU/Linux-system skrive cd- eller dvd-aftrykket til et USB-drev som i det følgende, efter at du har sikret dig at drevet er afmonteret:<informalexample><screen> <prompt>#</prompt> <userinput>cp <replaceable>debian.iso</replaceable> /dev/<replaceable>sdX</replaceable></userinput> <prompt>#</prompt> <userinput>sync</userinput> </screen></informalexample> Redskabet <ulink url="http://sf.net/projects/win32diskimager/"> win32diskimager</ulink> kan bruges under andre operativsystemer til at kopiere aftrykket.

source: The image must be written to the whole-disk device and not a partition, e.g. /dev/sdb and not /dev/sdb1. Do not use tools like <command>unetbootin</command> which alter the image.
da: Aftrykket skal skrives til whole-disk-enheden og ikke en partition, f.eks. /dev/sdb og ikke 7dev/sdb1. Brug ikke værktøjer såsom <command>unetbootin</command> som ændrer aftrykket.

source: Simply writing the CD or DVD image to USB like this should work fine for most users. The other options below are more complex, mainly for people with specialised needs.
da: En simpel skrivning af cd- eller dvd-aftrykket til USB bør fungere fint for de fleste brugere. De andre muligheder er mere komplekse og hovedsagelig for folk med specielle behov.

source: The hybrid image on the stick does not occupy all the storage space, so it may be worth considering using the free space to hold firmware files or packages or any other files of your choice. This could be useful if you have only one stick or just want to keep everything you need on one device.
da: Hybridaftrykket på drevet bruger ikke al lagerplads, så kan være en overvejelse værd at bruge den ledige plads til firmware-filer eller pakker eller andre filer efter dit eget valg. Dette kan være nyttigt, hvis du kun har et drev eller bare ønsker at have alt på en enhed.

source: Create a second, FAT partition on the stick, mount the partition and copy or unpack the firmware onto it. For example:
da: Opret endnu en FAT-partition på drevet, monter partitionen og kopier eller udpak firmwaren til den. For eksempel:

source: You might have written the <filename>mini.iso</filename> to the USB stick. In this case the second partition doesn't have to be created as, very nicely, it will already be present. Unplugging and replugging the USB stick should make the two partitions visible.
da: Du har skrevet <filename>mini.iso</filename> til USB-drevet. I dette tilfælde skal den anden partition ikke oprettes da, meget passende, den allerede vil være til stede. Fjernelse og isættelse af USB-drevet bør gøre de to partitioner synlige.

source: Manually copying files to the USB stick
da: Manuelt kopiere filer til USB-drevet

source: An alternative way to set up your USB stick is to manually copy the installer files, and also a CD image to it. Note that the USB stick should be at least 1 GB in size (smaller setups are possible if you follow <xref linkend="usb-copy-flexible"/>).
da: En alternativ måde at opsætte dit USB-drev er manuelt at kopiere installationsprogrammets filer, og også et cd-aftryk til drevet. Bemærk at USB-drevet skal være på mindst 1 GB (mindre opsætninger er muliger hvis du følger <xref linkend="usb-copy-flexible"/>).

source: There is an all-in-one file <filename>hd-media/boot.img.gz</filename> which contains all the installer files (including the kernel) <phrase arch="x86">as well as <classname>syslinux</classname> and its configuration file</phrase> <phrase arch="powerpc">as well as <classname>yaboot</classname> and its configuration file</phrase>.
da: Der er en alt i en-fil <filename>hd-media/boot.img.gz</filename> som indeholder alle installationsprogrammets filre (inklusive the kernen) <phrase arch="x86">samt <classname>syslinux</classname> og dets konfiguration file</phrase> <phrase arch="powerpc">samt <classname>yaboot</classname> og dets konfigurationsfil</phrase>.

source: Note that, although convenient, this method does have one major disadvantage: the logical size of the device will be limited to 1 GB, even if the capacity of the USB stick is larger. You will need to repartition the USB stick and create new file systems to get its full capacity back if you ever want to use it for some different purpose.
da: Bemærk dog, selvom det er nemt, at denne metode har en stor ulempe: Den logiske størrelse på enheden vil være begrænset til 1 GB, selv hvis kapaciteten på USB-drevet er større. Du skal partitionere USB-drevet igen og oprette nye filsystemer for at få den fulde kapacitet tilbage, hvis du ønsker at bruge den til andre formål.

source: To use this image simply extract it directly to your USB stick:
da: For at bruge dette aftryk udtrækkes det direkte til dit USB-drev:

source: Create a partition of type "Apple_Bootstrap" on your USB stick using <command>mac-fdisk</command>'s <userinput>C</userinput> command and extract the image directly to that:
da: Opret en partition af typen »Apple_Bootstrap« på dit USB-drev via <command>mac-fdisk</command>s <userinput>C</userinput>-kommando og udtræk aftrykket direkte til denne:

source: After that, mount the USB memory stick <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> which will now have <phrase arch="x86">a FAT filesystem</phrase> <phrase arch="powerpc">an HFS filesystem</phrase> on it, and copy a &debian; ISO image (netinst or full CD) to it. Unmount the stick (<userinput>umount /mnt</userinput>) and you are done.
da: Derefter monteres USB-hukommelsesdrevet <phrase arch="x86">(<userinput>mount /dev/<replaceable>sdX</replaceable> /mnt</userinput>),</phrase> <phrase arch="powerpc">(<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>),</phrase> som nu vil have <phrase arch="x86">et FAT-filsystem</phrase> <phrase arch="powerpc">et HFS-filsystem</phrase> på sig og kopier et &debian; ISO-aftryk (netinst eller fuld cd) til den. Afmonter drevet (<userinput>umount /mnt</userinput>) og du er færdig.

source: Manually copying files to the USB stick &mdash; the flexible way
da: Manuelt kopiere filer til USB-drevet &mdash; den fleksible måde

source: If you like more flexibility or just want to know what's going on, you should use the following method to put the files on your stick. One advantage of using this method is that &mdash; if the capacity of your USB stick is large enough &mdash; you have the option of copying any ISO image, even a DVD image, to it.
da: Hvis du ønsker højere fleksibilitet eller bare ønsker at vide, hvad der foregår, så kan du bruge en af de følgende metoder til at placere filerne på dit drev. En af fordelene ved denne metode er at &mdash; hvis kapaciteten på dit USB-drev er stor nok &mdash; så kan du kopiere ethvert ISO-aftryk eller endda et dvd-aftryk til drevet.

source: Partitioning the USB stick
da: Partitionering af USB-drevet

source: We will show how to set up the memory stick to use the first partition, instead of the entire device.
da: Vi vil vise hvordan hukommelsesdrevet opsættes til at bruge den første partition, i stedet for hele enheden.

source: Since most USB sticks come pre-configured with a single FAT16 partition, you probably won't have to repartition or reformat the stick. If you have to do that anyway, use <command>cfdisk</command> or any other partitioning tool to create a FAT16 partition<footnote> <para> Don't forget to set the <quote>bootable</quote> bootable flag. </para> </footnote>, install an MBR using: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> The <command>install-mbr</command> command is contained in the <classname>mbr</classname> &debian; package. Then create the filesystem using: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>mkdosfs</command> command is contained in the <classname>dosfstools</classname> &debian; package.
da: Da de fleste USB-drev kommer prækonfigurede med en enkel FAT16-partition, så skal du sandsynligvis ikke partitioner eller formatere drevet igen. Hvis du alligevel skal gøre dette, så brug <command>cfdisk</command> eller et andet partitioneringsværktøj til at oprette en FAT16-partition<footnote> <para> Glem ikke at angive opstartsflaget <quote>bootable</quote>. </para> </footnote>, installer en MBR via: <informalexample><screen> # install-mbr /dev/<replaceable>sdX</replaceable> </screen></informalexample> Kommandoen <command>install-mbr</command> er indeholdt i &debian;-pakken <classname>mbr</classname>. Opret så filsystemet med: <informalexample><screen> # mkdosfs /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Vær opmærksom på at bruge det korrekte enhedsnavn for dit USB-drev. Kommandoen <command>mkdosfs</command> er indeholdt i &debian;-pakken <classname>dosfstools</classname>.

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. Although any boot loader (e.g. <classname>lilo</classname>) should work, it's convenient to use <classname>syslinux</classname>, since it uses a FAT16 partition and can be reconfigured by just editing a text file. Any operating system which supports the FAT file system can be used to make changes to the configuration of the boot loader.
da: For at starte kernen efter opstart fra USB-drevet, vil vi placere en opstartsindlæser på drevet. Selvom enhver opstartsindlæser (f.eks. <classname>lilo</classname>) bør fungere, er det nemt at bruge <classname>syslinux</classname>, da den bruger en FAT16-partition og kan konfigureres om ved bare at redigere en tekstfil. Ethvert operativsystem som understøtter FAT-filsystemet kan bruges til at lave ændringer til konfigurationen af opstartsindlæseren.

source: To put <classname>syslinux</classname> on the FAT16 partition on your USB stick, install the <classname>syslinux</classname> and <classname>mtools</classname> packages on your system, and do: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Again, take care that you use the correct device name. The partition must not be mounted when starting <command>syslinux</command>. This procedure writes a boot sector to the partition and creates the file <filename>ldlinux.sys</filename> which contains the boot loader code.
da: For at placere <classname>syslinux</classname> på FAT16-partitionen på dit USB-drev, så installer pakkerne <classname>syslinux</classname> og <classname>mtools</classname> på dit system, og udfør: <informalexample><screen> # syslinux /dev/<replaceable>sdX1</replaceable> </screen></informalexample> Igen husk at sikre dig, at du bruger det korrekte enhedsnavn. Partitionen må ikke være monteret når <command>syslinux</command> startes. Denne procedure skriver en opstartssektor til partionen og opretter filen <filename>ldlinux.sys</filename>, som indeholder koden for opstartsindlæseren.

source: Adding the installer image
da: Tilføjelse af installationsprogrammets aftryk

source: Mount the partition (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) and copy the following installer image files to the stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> or <filename>linux</filename> (kernel binary) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (initial ramdisk image) </para></listitem> </itemizedlist> You can choose between either the text-based or the graphical version of the installer. The latter can be found in the <filename>gtk</filename> subdirectory. If you want to rename the files, please note that <classname>syslinux</classname> can only process DOS (8.3) file names.
da: Monter partitionen (<userinput>mount /dev/<replaceable>sdX1</replaceable> /mnt</userinput>) og kopier de følgende installationsaftryksfiler til drevet: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> eller <filename>linux</filename> (kernel binary) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (initial ramdisk image) </para></listitem> </itemizedlist> Du kan vælge mellem enten den tekstbaserede eller grafiske version af installationsprogrammet. Den sidste kan findes i undermappen <filename>gtk</filename>. Hvis du ønsker at omdøbe filerne, så bemærk venligst at <classname>syslinux</classname> kun kan behandle DOS-filnavne (8.3).

source: To enable the boot prompt to permit further parameter appending, add a <userinput>prompt 1</userinput> line.
da: For at aktivere opstartsprompten til at acceptere yderligere parametertilføjelse, tilføjes en linje <userinput>prompt 1</userinput>.

source: If you used an <filename>hd-media</filename> image, you should now copy the ISO file of a &debian; ISO image<footnote> <para> You can use either a netinst or a full CD image (see <xref linkend="official-cdrom"/>). Be sure to select one that fits. Note that the <quote>netboot <filename>mini.iso</filename></quote> image is not usable for this purpose. </para> </footnote> onto the stick. When you are done, unmount the USB memory stick (<userinput>umount /mnt</userinput>).
da: Hvis du anvendte et <filename>hd-media</filename>-aftryk, så bør du kopiere ISO-filen for et &debian;-ISO-aftryk<footnote> <para> Du kan bruge enten en netinst eller et fuld cd-aftryk (se <xref linkend="official-cdrom"/>). Vær sikker på at vælge et som passer. Bemærk at <quote>netboot <filename>mini.iso</filename></quote>-aftrykket ikke er brugbar til dette formål. </para> </footnote> ned på drevet. Når du er færdig, afmonter USB-drevet (<userinput>umount /mnt</userinput>).

source: Most USB sticks do not come pre-configured in such a way that Open Firmware can boot from them, so you will need to repartition the stick. On Mac systems, run <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, initialise a new partition map using the <userinput>i</userinput> command, and create a new partition of type Apple_Bootstrap using the <userinput>C</userinput> command. (Note that the first "partition" will always be the partition map itself.) Then type <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>hformat</command> command is contained in the <classname>hfsutils</classname> &debian; package.
da: De fleste USB-drev er ikke prækonfigurerede på en sådan måde at Open Firmware kan starte op fra dem, så du skal partitionere drevet om. På Mac-systemer, kør <userinput>mac-fdisk /dev/<replaceable>sdX</replaceable></userinput>, initialiser et nyt partitionskort via kommandoen <userinput>i</userinput>, og opret en ny partition af typen Apple_Bootstrap via kommandoen <userinput>C</userinput>. (Bemærk at den første »partition« altid vil være selve partitionskortet). Tast så <informalexample><screen> $ hformat /dev/<replaceable>sdX2</replaceable> </screen></informalexample> Sikr dig, at du bruger det korrekte enhedsnavn på dit USB-drev. Kommandoen <command>hformat</command> er indeholdt i &debian;-pakken <classname>hfsutils</classname>.

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. The <command>yaboot</command> boot loader can be installed on an HFS filesystem and can be reconfigured by just editing a text file. Any operating system which supports the HFS file system can be used to make changes to the configuration of the boot loader.
da: For at starte kernen efter opstart fra USB-drevet, vil vi placere en opstartsindlæser på drevet. Opstartsindlæseren <command>yaboot</command> kan installeres på et HFS-filsystem og kan konfigureres om ved bare at redigere en tekstfil. Alle operativsystemer som understøtter HFS-filsystemet kan bruges til at udføre ændringer til konfigurationen af opstartsindlæseren.
