Repository: bipulkumar7/DebianInstaller
Catalog: manual/po/*/install-methods.po
Languages: da

source: The normal <command>ybin</command> tool that comes with <command>yaboot</command> does not yet understand USB storage devices, so you will have to install <command>yaboot</command> by hand using the <classname>hfsutils</classname> tools. Type <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Again, take care that you use the correct device name. The partition must not be otherwise mounted during this procedure. This procedure writes the boot loader to the partition, and uses the HFS utilities to mark it in such a way that Open Firmware will boot it. Having done this, the rest of the USB stick may be prepared using the normal Unix utilities.
da: Det normale værktøj <command>ybin</command>, som følger med <command>yaboot</command> forstår endnu ikke USB-lagerenheder, så du skal installere <command>yaboot</command> manuelt via <classname>hfsutils</classname>-værktøjerne. Tast <informalexample><screen> $ hmount /dev/<replaceable>sdX2</replaceable> $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Sikr dig, at du bruger det korrekte enhedsnavn. Partitionen må ikke på anden vis monteres under denne procedure. Denne procedure skriver opstartsindlæseren til partitionen, og bruger HFS-redskaberne til at markere den på en måde så at Open Firmware vil starte den op. Når dette er gjort kan resten af USB-drevet forberedes med normale UNIX-redskaber.

source: Mount the partition (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) and copy the following installer image files to the stick:
da: Monter partitionen (<userinput>mount /dev/<replaceable>sdX2</replaceable> /mnt</userinput>) og kopier de følgende installationsaftryksfiler til drevet:

source: <filename>vmlinux</filename> (kernel binary)
da: <filename>vmlinux</filename> (kernens binære fil)

source: <filename>initrd.gz</filename> (initial ramdisk image)
da: <filename>initrd.gz</filename> (oprindelig ramdisk-aftryk)

source: <filename>yaboot.conf</filename> (yaboot configuration file)
da: <filename>yaboot.conf</filename> (yaboot-konfigurationsfil)

source: <filename>boot.msg</filename> (optional boot message)
da: <filename>boot.msg</filename> (valgfri opstartsbesked)

source: The <filename>yaboot.conf</filename> configuration file should contain the following lines: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Please note that the <userinput>initrd-size</userinput> parameter may need to be increased, depending on the image you are booting.
da: Konfigurationsfilen <filename>yaboot.conf</filename> bør indeholder de følgende linjer: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000 read-only </screen></informalexample> Bemærk venligst at parameteren <userinput>initrd-size</userinput> måske skal øges, afhængig af aftrykket du indlæser.

source: Preparing Files for Hard Disk Booting
da: Forberedelse af filer for harddiskopstart

source: The installer may be booted using boot files placed on an existing hard drive partition, either launched from another operating system or by invoking a boot loader directly from the BIOS.
da: Installationsprogrammet kan startes ved at bruges opstartsfiler placeret på en eksisterende harddiskpartition, enten startet fra et andet operativsystem eller ved at igangsætte en opstartsindlæser direkte fra BIOS'en.

source: A full, <quote>pure network</quote> installation can be achieved using this technique. This avoids all hassles of removable media, like finding and burning CD images or struggling with too numerous and unreliable floppy disks.
da: En fuld, <quote>ren netværksinstallation</quote> kan opnås via denne teknik. Dette undgår alle problemerne forbundet med eksterne medier, såsom af finde og brænde cd-aftryk eller kæmpe med for mange og utroværdige disketter.

source: The installer cannot boot from files on an HFS+ file system. MacOS System 8.1 and above may use HFS+ file systems; NewWorld PowerMacs all use HFS+. To determine whether your existing file system is HFS+, select <userinput>Get Info</userinput> for the volume in question. HFS file systems appear as <userinput>Mac OS Standard</userinput>, while HFS+ file systems say <userinput>Mac OS Extended</userinput>. You must have an HFS partition in order to exchange files between MacOS and Linux, in particular the installation files you download.
da: Installationsprogrammet kan ikke starte op fra filer på et HFS+-filsystem. MacOS System 8.1 og senere kan bruge HFS+-filsystemer; NewWorld PowerMacs bruger alle HFS+. For at bestemme om dit eksisterende filsystem er HFS+, vælges <userinput>Hent information</userinput> for diskenheden. HFS-filsystemet fremstår som <userinput>Mac OS Standard</userinput>, mens HFS+-filsystemet er <userinput>Mac OS Extended</userinput>. Du skal have en HFS-partition for at udtrække filer mellem MacOS og Linux, specielt installationsfilerne du hentede.

source: Different programs are used for hard disk installation system booting, depending on whether the system is a <quote>NewWorld</quote> or an <quote>OldWorld</quote> model.
da: Forskellige programmer bruges til systemopstart af installationen fra harddisk afhængig af om systemet er <quote>NewWorld</quote> eller <quote>OldWorld</quote>.

source: Hard disk installer booting from Linux using <command>LILO</command> or <command>GRUB</command>
da: Installationsprogrammets opstart fra harddisk fra Linux med brug af <command>LILO</command> eller <command>GRUB</command>

source: This section explains how to add to or even replace an existing linux installation using either <command>LILO</command> or <command>GRUB</command>.
da: Dette afsnit forklarer hvordan du tilføjer eller erstatter en eksisterende Linux-installation via enten <command>LILO</command> eller <command>GRUB</command>.

source: At boot time, both bootloaders support loading in memory not only the kernel, but also a disk image. This RAM disk can be used as the root file-system by the kernel.
da: Ved opstart, understøtter begge opstartsindlæsere indlæsning i hukommelse ikke kun af kernen, men også af et diskaftryk. Denne RAM-disk kan bruges som rodfilsystem af kernen.

source: Copy the following files from the &debian; archives to a convenient location on your hard drive (note that LILO can not boot from files on an NTFS file system), for instance to <filename>/boot/newinstall/</filename>.
da: Kopier de følgende filer fra &debian;-arkiverne til en passende placering på din harddisk (bemærk at LILO ikke kan starte op fra filer på et NFTS-filsystem), for eksempel <filename>/boot/newinstall/</filename>.

source: <filename>vmlinuz</filename> (kernel binary)
da: <filename>vmlinuz</filename> (kernens binære fil)

source: <filename>initrd.gz</filename> (ramdisk image)
da: <filename>initrd.gz</filename> (ramdisk-aftryk)

source: Finally, to configure the bootloader proceed to <xref linkend="boot-initrd"/>.
da: Endelig, for at konfigure opstartsindllæseren fortsættes til <xref linkend="boot-initrd"/>.

source: Hard disk installer booting from DOS using <command>loadlin</command>
da: Harddiskinstallationen starter op fra DOS med <command>loadlin</command>

source: This section explains how to prepare your hard drive for booting the installer from DOS using <command>loadlin</command>.
da: Dette afsnit forklarer hvordan du forbereder din harddisk til at starte installationsprogrammet op fra DOS med <command>loadlin</command>.

source: Copy the following directories from a &debian; CD image to <filename>c:\</filename>.
da: Kopier de følgende mapper fra et &debian;-cd-aftryk til <filename>c:\</filename>.

source: <filename>/&x86-install-dir;</filename> (kernel binary and ramdisk image)
da: <filename>/&x86-install-dir;</filename> (kernens binære fil og ramdiskaftryk)

source: <filename>/tools</filename> (loadlin tool)
da: <filename>/tools</filename> (loadlin-værktøj)

source: Hard Disk Installer Booting for OldWorld Macs
da: Harddiskinstallation med opstart fra OldWorld Macs

source: The <filename>boot-floppy-hfs</filename> floppy uses <application>miBoot</application> to launch Linux installation, but <application>miBoot</application> cannot easily be used for hard disk booting. <application>BootX</application>, launched from MacOS, supports booting from files placed on the hard disk. <application>BootX</application> can also be used to dual-boot MacOS and Linux after your &debian; installation is complete. For the Performa 6360, it appears that <command>quik</command> cannot make the hard disk bootable. So <application>BootX</application> is required on that model.
da: Disketten <filename>boot-floppy-hfs</filename> bruger <application>miBoot</application> til at starte Linux-installation, men <application>miBoot</application> kan ikke nemt bruges for harddiskopstart. <application>BootX</application>, startet fra MacOS, understøtter opstart fra filer placeret på harddisken. <application>BootX</application> kan også bruges til dual-boot af MacOS og Linux efter din &debian;-installation er færdig. For Performa 6360 virker det som om, at <command>quik</command> ikke kan gøre harddisken opstartbar. Så <application>BootX</application> er krævet på den model.

source: Download and unstuff the <application>BootX</application> distribution, available from <ulink url="&url-powerpc-bootx;"></ulink>, or in the <filename>dists/woody/main/disks-powerpc/current/powermac</filename> directory on &debian; http/ftp mirrors and official &debian; CDs. Use <application>Stuffit Expander</application> to extract it from its archive. Within the package, there is an empty folder called <filename>Linux Kernels</filename>. Download <filename>linux.bin</filename> and <filename>ramdisk.image.gz</filename> from the <filename>disks-powerpc/current/powermac</filename> folder, and place them in the <filename>Linux Kernels</filename> folder. Then place the <filename>Linux Kernels</filename> folder in the active System Folder.
da: Hent og pak <application>BootX</application>-distributionen ud, som er tilgængelig fra <ulink url="&url-powerpc-bootx;"></ulink>, eller i mappen <filename>dists/woody/main/disks-powerpc/current/powermac</filename>på &debian; http/ftp-spejl og officielle &debian;-cd'er. Brug <application>Stuffit Expander</application> til at udtrække den fra dens arkiv. Inden i pakken er der en tom mappe kaldt <filename>Linux Kernels</filename>. Hent <filename>linux.bin</filename> og <filename>ramdisk.image.gz</filename> fra mappen <filename>disks-powerpc/current/powermac</filename> og placer dem i mappen <filename>Linux Kernels</filename>. Placer så mappen <filename>Linux Kernels</filename> i den aktive systemmappe.

source: Hard Disk Installer Booting for NewWorld Macs
da: Harddiskinstallation med opstart fra NewWorld Macs

source: NewWorld PowerMacs support booting from a network or an ISO9660 CD-ROM, as well as loading ELF binaries directly from the hard disk. These machines will boot Linux directly via <command>yaboot</command>, which supports loading a kernel and RAMdisk directly from an ext2 partition, as well as dual-booting with MacOS. Hard disk booting of the installer is particularly appropriate for newer machines without floppy drives. <command>BootX</command> is not supported and must not be used on NewWorld PowerMacs.
da: NewWorld PowerMacs understøtter opstart fra et netværk eller en ISO9660-cd-rom, samt indlæsning af ELF's binære filer direkte fra harddisken. Disse maskiner vil starte Linux direkte via <command>yaboot</command>, som understøtter indlæsning af en kerne og RAMdisk direkte fra en ext2-partition, samt som dual-booting med MacOS. Harddiskopstart af installationsprogrammet er specielt passende for nyere maskiner uden diskettedrev. <command>BootX</command> er ikke understøttet og må ikke bruges på NewWorld PowerMacs.

source: <emphasis>Copy</emphasis> (not move) the following four files which you downloaded earlier from the &debian; archives, onto the root level of your hard drive (this can be accomplished by <keycap>option</keycap>-dragging each file to the hard drive icon).
da: <emphasis>Kopier</emphasis> (flyt ikke) de følgende fire filer, som du hentede fra &debian;-arkiverne, til rodniveauet for din harddisk (dette kan opnås ved <keycap>option</keycap>-trækning af hver fil til harddiskikonet).

source: Make a note of the partition number of the MacOS partition where you place these files. If you have the MacOS <command>pdisk</command> program, you can use the <command>L</command> command to check for the partition number. You will need this partition number for the command you type at the Open Firmware prompt when you boot the installer.
da: Lav en note om partitionsnummeret for MacOS-partitionen, hvor du placerer disse filer. Hvis du har MacOS-programmet <command>pdisk</command>, så kan du bruge kommandoen <command>L</command> til at kontrollere partitionsnummeret. Du skal bruge dette partitionsnummer i kommandoen du indtaster i Open Firmware-prompten når du starter installationsprogrammet op.

source: To boot the installer, proceed to <xref linkend="boot-newworld"/>.
da: For at starte installationsprogrammet op, fortsæt til <xref linkend="boot-newworld"/>.

source: Preparing Files for TFTP Net Booting
da: Forberedelse af filer for TFTP-netopstart

source: If your machine is connected to a local area network, you may be able to boot it over the network from another machine, using TFTP. If you intend to boot the installation system from another machine, the boot files will need to be placed in specific locations on that machine, and the machine configured to support booting of your specific machine.
da: Hvis din maskine er forbundet på et lokalt områdenetværk, så kan du måske starte den op over netværket fra en anden maskine, via TFTP. Hvis du har tænkt dig at starte installationssystemet op fra en anden maskine, så vil opstartsfilerne skulle placeres på specifikke placeringer på den maskine, og maskinen skal konfigureres til at understøtte opstart fra din specfikke maskine.

source: You need to set up a TFTP server, and for many machines a DHCP server<phrase condition="supports-rarp">, or RARP server</phrase><phrase condition="supports-bootp">, or BOOTP server</phrase>.
da: Du skal opsætte en TFTP-server, og for mange maskiner en DHCP-server<phrase condition="supports-rarp">, eller RARP-server</phrase><phrase condition="supports-bootp">, eller BOOTP-server</phrase>.

source: <phrase condition="supports-rarp">The Reverse Address Resolution Protocol (RARP) is one way to tell your client what IP address to use for itself. Another way is to use the BOOTP protocol.</phrase> <phrase condition="supports-bootp">BOOTP is an IP protocol that informs a computer of its IP address and where on the network to obtain a boot image.</phrase> The DHCP (Dynamic Host Configuration Protocol) is a more flexible, backwards-compatible extension of BOOTP. Some systems can only be configured via DHCP.
da: <phrase condition="supports-rarp">The Reverse Address Resolution Protocol (RARP) er en måde at fortælle din klient, hvilken IP-adresse der skal bruges internt. En anden måde er at bruge BOOTP-protokollen.</phrase> <phrase condition="supports-bootp">BOOTP er en IP-protokol, som informerer en computer om dens IP-adresse og hvor på netværket du kan finde et opstartsaftryk.</phrase> DHcP'en (Dynamic Host Configuration Protocol) er en mere fleksibel, bagud kompatibel udvidelse af BOOTP. Nogle systemer kan kun konfigureres via DHCP.

source: For PowerPC, if you have a NewWorld Power Macintosh machine, it is a good idea to use DHCP instead of BOOTP. Some of the latest machines are unable to boot using BOOTP.
da: For PowerPC, hvis du har en NewWorld Power Macintosh-maskine, er det en god ide at bruge DHCP i stedet for BOOTP. Nogle af de seneste maskiner kan ikke starte op via BOOTP.

source: Some older HPPA machines (e.g. 715/75) use RBOOTD rather than BOOTP. There is an <classname>rbootd</classname> package available in &debian;.
da: Nogle ældre HPPA-maskiner (f.eks. 715/75) bruger RBOOTD frem for BOOTP. Der er en <classname>rbootd</classname>-pakke tilgængelig i &debian;.

source: The Trivial File Transfer Protocol (TFTP) is used to serve the boot image to the client. Theoretically, any server, on any platform, which implements these protocols, may be used. In the examples in this section, we shall provide commands for SunOS 4.x, SunOS 5.x (a.k.a. Solaris), and GNU/Linux.
da: Trivial File Transfer Protocol (TFTP) bruges til at levere opstartsaftrykket til klienten. Teoretisk kan enhver server på enhver platform, som implementerer disse protokoller, anvendes. I eksemplerne i dette afsnit angiver vi kommandoer for SunOS 4.x, SunOS 5.x (a.k.a. Solaris) og GNU/Linux.

source: For a &debian-gnu; server we recommend <classname>tftpd-hpa</classname>. It's written by the same author as the <classname>syslinux</classname> bootloader and is therefore least likely to cause issues. A good alternative is <classname>atftpd</classname>.
da: For en &debian-gnu;-server anbefaler vi <classname>tftpd-hpa</classname>. Den er skrevet af den samme forfatter som opstartsindlæseren <classname>syslinux</classname> og er derfor den mindst sandsynlige årsag til problemstillinger. Et godt alternativ er <classname>atftpd</classname>.

source: Setting up RARP server
da: Opsætning af en RARP-server

source: To set up RARP, you need to know the Ethernet address (a.k.a. the MAC address) of the client computers to be installed. If you don't know this information, you can <phrase arch="sparc"> pick it off the initial OpenPROM boot messages, use the OpenBoot <userinput>.enet-addr</userinput> command, or </phrase> boot into <quote>Rescue</quote> mode (e.g., from the rescue floppy) and use the command <userinput>ip addr show dev eth0</userinput>.
da: For at opsætte RARP, så skal ud kende Ethernet-adressen (a.k.a. MAC-adressen) på klientcomputerne der skal installeres på. Hvis du ikke kender denne information, så kan du <phrase arch="sparc"> samle den op fra de oprindelige OpenPROM-opstartsbeskeder, brug kommandoen OpenBoot <userinput>.enet-addr</userinput>, eller </phrase> start op i <quote>Redningstilstand</quote>(f.eks. fra redningsdisketten) og brug kommandoen <userinput>ip addr show dev eth0</userinput>.

source: On a RARP server system using a Linux kernel or Solaris/SunOS, you use the <command>rarpd</command> program. You need to ensure that the Ethernet hardware address for the client is listed in the <quote>ethers</quote> database (either in the <filename>/etc/ethers</filename> file, or via NIS/NIS+) and in the <quote>hosts</quote> database. Then you need to start the RARP daemon. Issue the command (as root): <userinput>/usr/sbin/rarpd -a</userinput> on most Linux systems and SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> on some other Linux systems, or <userinput>/usr/etc/rarpd -a</userinput> in SunOS 4 (Solaris 1).
da: På et RARP-serversystem der bruger Linux-kernen eller Solaris/SunOS, skal du bruge programmet <command>rarpd</command>. Du skal sikre dig, at Ethernettets udstyrsadresse for klienten vises i databasen <quote>ethers</quote> (enten i filen <filename>/etc/ethers</filename>, eller via NIS/NIS+) og i databasen <quote>hosts</quote>. Så skal du starte RARP-dæmonen. Udsted kommandoen (som root): <userinput>/usr/sbin/rarpd -a</userinput> på de fleste Linux-systemer og SunOS 5 (Solaris 2), <userinput>/usr/sbin/in.rarpd -a</userinput> på nogle andre Linux-systemer, eller <userinput>/usr/etc/rarpd -a</userinput> i SunOS 4 (Solaris 1).

source: Setting up a DHCP server
da: Opsætning af en DHCP-server

source: One free software DHCP server is ISC <command>dhcpd</command>. For &debian-gnu;, the <classname>isc-dhcp-server</classname> package is recommended. Here is a sample configuration file for it (see <filename>/etc/dhcp/dhcpd.conf</filename>):
da: En fri DHCP-server er ISC <command>dhcpd</command>. For &debian-gnu; anbefales pakken <classname>isc-dhcp-server</classname>. Her er et eksempel på en konfigurationsfil for den (se <filename>/etc/dhcp/dhcpd.conf</filename>):

source: In this example, there is one server <replaceable>servername</replaceable> which performs all of the work of DHCP server, TFTP server, and network gateway. You will almost certainly need to change the domain-name options, as well as the server name and client hardware address. The <replaceable>filename</replaceable> option should be the name of the file which will be retrieved via TFTP.
da: I dette eksempel er der en server <replaceable>servername</replaceable> som udfører al arbejdet på DHCP-serveren, TFTP-serveren og netværksadgangspunktet. Du har med stor sandsynlighed behov for at ændre indstillinger for domænenavnet samt servernavnet og klientens udstyrsadresse. Indstillingen <replaceable>filename</replaceable> skal være navnet på filen, som hentes via TFTP.

source: After you have edited the <command>dhcpd</command> configuration file, restart it with <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
da: Efter du har redigeret konfigurationsfilen <command>dhcpd</command>, så genstart den med <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.

source: Enabling PXE Booting in the DHCP configuration
da: Aktivering af PXE-opstart i DHCP-konfigurationen

source: Here is another example for a <filename>dhcp.conf</filename> using the Pre-boot Execution Environment (PXE) method of TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Note that for PXE booting, the client filename <filename>pxelinux.0</filename> is a boot loader, not a kernel image (see <xref linkend="tftp-images"/> below).
da: Her er et andet eksempel for <filename>dhcp.conf</filename>, der rbuger Pre-boot Execution Environment (PXE)-metoden for TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "pxelinux.0"; } } </screen></informalexample> Bemærk at for PXE-opstart, er klientfilnavnet <filename>pxelinux.0</filename> en opstartsindlæser, ikke et kerneaftryk (se <xref linkend="tftp-images"/> below).

source: Setting up a BOOTP server
da: Opsætning af en BOOTP-server
