Repository: bipulkumar7/DebianInstaller
Catalog: manual/po/*/install-methods.po
Languages: da

source: Obtaining System Installation Media
da: Find systeminstallationsmedie

source: Official &debian-gnu; CD/DVD-ROM Sets
da: Officielle &debian-gnu; cd/dvd-rom-sæt

source: By far the easiest way to install &debian-gnu; is from an Official &debian; CD/DVD-ROM Set. You can buy a set from a vendor (see the <ulink url="&url-debian-cd-vendors;">CD vendors page</ulink>). You may also download the CD/DVD-ROM images from a &debian; mirror and make your own set, if you have a fast network connection and a CD/DVD burner (see the <ulink url="&url-debian-cd;">Debian CD page</ulink> and <ulink url="&url-debian-cd-faq;">Debian CD FAQ</ulink> for detailed instructions). If you have a &debian; CD/DVD set and CDs/DVDs are bootable on your machine<phrase arch="x86">, which is the case on all modern PCs</phrase>, you can skip right to <xref linkend="boot-installer"/>. Much effort has been expended to ensure the most-used files are on the first CDs and DVDs, so that a basic desktop installation can be done with only the first DVD or - to a limited extent - even with only the first CD.
da: Den bedste måde at installere &debian-gnu; er fra det officielle &debian; cd/dvd-rom-sæt. Du kan købe et sæt fra en leverandør (se <ulink url="&url-debian-cd-vendors;">cd-leverandørsiden</ulink>). Du kan også hente cd/dvd-rom-aftrykket fra et &debian;-spejl og lave dit eget sæt, hvis du har en hurtig netværksforbindelse og en cd/dvd-brænder (se <ulink url="&url-debian-cd;">Debians cd-side</ulink> og <ulink url="&url-debian-cd-faq;">Debians cd-OSS</ulink>). Hvis du har et &debian; cd/dvd-sæt og cd'er/dvd'er kan opstartes på din maskine <phrase arch="x86">, hvilket er tilfældet for alle moderne pc'er</phrase>, så kan du gå direkte til <xref linkend="boot-installer"/>. Der er brugt en stor indsats for at sikre at de mest anvendte filer er på den første cd eller dvd, så en installation af basissystemet kan udføres kun med den første dvd eller - i begrænset omfang - selv med den første cd.

source: As CDs have a rather limited capacity by today's standards, not all graphical desktop environments are installable with only the first CD; for some desktop environments a CD installation requires either network connectivity during the installation to download the remaining files or additional CDs.
da: Da cd'er har en ret så begrænset kapacitet efter nutidens standarder, kan ikke alle grafiske skrivebordsmiljøet installeres kun med den første cd; for nogle skrivebordsmiljøet kræver en cd-installation enten netværksforbindelse under installationen for at hente de resternede filer eller yderligere cd'er.

source: If your machine doesn't support CD booting<phrase arch="x86"> (only relevant on very old PC systems)</phrase>, but you do have a CD set, you can use an alternative strategy such as <phrase condition="supports-floppy-boot">floppy disk,</phrase> <phrase arch="s390">VM reader,</phrase> <phrase condition="bootable-disk">hard disk,</phrase> <phrase condition="bootable-usb">usb stick,</phrase> <phrase condition="supports-tftp">net boot,</phrase> or manually loading the kernel from the CD to initially boot the system installer. The files you need for booting by another means are also on the CD; the &debian; network archive and CD folder organization are identical. So when archive file paths are given below for particular files you need for booting, look for those files in the same directories and subdirectories on your CD.
da: Hvis din maskine ikke understøtter cd-opstart<phrase arch="x86"> (kun relevant på meget gamle pc-systemer)</phrase>, men du har et cd-sæt, så kan du bruge en alternativ strategi såsom <phrase condition="supports-floppy-boot">diskettedrev,</phrase> <phrase arch="s390">VM-læser,</phrase> <phrase condition="bootable-disk">harddisk,</phrase> <phrase condition="bootable-usb">usb-drev,</phrase> <phrase condition="supports-tftp">net-opstart,</phrase> eller manuelt indlæse kernen fra cd'en for her i starten at få gang i systeminstallationsprogrammet. Filerne du skal bruge til at starte op med andre metoder er også på cd'en; &debian;-netværksarkivet og cd-mappeorganisationen er identisk. Så når arkivfilstier angives nedenfor for bestemte filer du skal bruge til at starte op, så skal du kigge efter disse filer i de samme mapper og undermapper på din cd.

source: Once the installer is booted, it will be able to obtain all the other files it needs from the CD.
da: Når installationsprogrammet er startet op, så vil det hente alle de andre nødvendige filer fra cd'en.

source: If you don't have a CD set, then you will need to download the installer system files and place them on the <phrase arch="s390">VM minidisk</phrase> <phrase condition="supports-floppy-boot">floppy disk or</phrase> <phrase condition="bootable-disk">hard disk or</phrase> <phrase condition="bootable-usb">usb stick or</phrase> <phrase condition="supports-tftp">a connected computer</phrase> so they can be used to boot the installer.
da: Hvis du ikke har et cd-sæt, så skal du hente installationsprogrammets systemfiler og placere dem på <phrase arch="s390">VM-minidisk</phrase> <phrase condition="supports-floppy-boot">diskettedrev eller</phrase> <phrase condition="bootable-disk">harddisk eller</phrase> <phrase condition="bootable-usb">usb-drev eller</phrase> <phrase condition="supports-tftp">en computer med internetforbindelse</phrase> så de kan brugs til at starte installationsprogrammet op.

source: Downloading Files from &debian; Mirrors
da: Hentning af filer fra &debian;-spejl

source: To find the nearest (and thus probably the fastest) mirror, see the <ulink url="&url-debian-mirrors;">list of &debian; mirrors</ulink>.
da: For at finde det nærmeste (og dermed sandsynligvis det hurtigste) spejl, så se <ulink url="&url-debian-mirrors;">liste over &debian;-spejle</ulink>.

source: When downloading files from a &debian; mirror using FTP, be sure to download the files in <emphasis>binary</emphasis> mode, not text or automatic mode.
da: Nå du henter filer fra et &debian;spejl der bruger FTP, så skal du sikre dig at hente filerne i <emphasis>binær</emphasis> tilstand, ikke tekst eller automatisk tilstand.

source: Where to Find Installation Images
da: Her kan du finde installationsaftryk

source: The installation images are located on each &debian; mirror in the directory <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; the <ulink url="&url-debian-installer;images/MANIFEST">MANIFEST</ulink> lists each image and its purpose.
da: Installationsaftrykkene er placeret på hvert &debian;-spejl i mappen <ulink url="&url-debian-installer;images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; <ulink url="&url-debian-installer;images/MANIFEST">MANIFESTET</ulink> viser hvert aftryk og dets formål.

source: Kurobox Pro Installation Files
da: Kurobox Pro-installationsfiler

source: The Kurobox Pro requires a kernel and ramdisk on an ext2 partition on the disk on which you intend to install &debian;. These images can be obtained from &kuroboxpro-firmware-img;.
da: Kurobox Pro kræver en kerne og ramdisk på en ext2-partition på disken du forventer at installere &debian;. Disse aftryk kan indhentes fra &kuroboxpro-firmware-img;.

source: HP mv2120 Installation Files
da: HP mv2120-installationsfiler

source: A firmware image is provided for the HP mv2120 which will automatically boot <classname>debian-installer</classname>. This image can be installed with uphpmvault on Linux and other systems and with the HP Media Vault Firmware Recovery Utility on Windows. The firmware image can be obtained from &mv2120-firmware-img;.
da: Et firmware-aftryk tilbydes for HP mv2120 som automatisk vil starte <classname>Debians installationsprogram</classname> op. Dette aftryk kan installeres med uphpmvault på Linux og andre systemer og med HP Media Vault Firmware Recovery Utility på Windows. Firmware-aftrykket kan hentes fra &mv2120-firmware-img;.

source: QNAP Turbo Station Installation Files
da: QNAP Turbo Station-installationsfiler

source: Plug Computer and OpenRD Installation Files
da: Plug Computer og OpenRD-installationsfiler

source: The installation files for plug computers (SheevaPlug, GuruPlug, DreamPlug etc) and OpenRD devices consist of a kernel and initrd for U-Boot. You can obtain these files from &kirkwood-marvell-firmware-img;.
da: Installationsfilerne for plug-computere (SheevaPlug, GuruPlug, DreamPlug etc.) og OpenRD-enheder består af en kerne og initrd for U-Boot. Du kan hente disse filer fra &kirkwood-marvell-firmware-img;.

source: LaCie NASes Installation Files
da: LaCie NASes-installationsfiler

source: The installation files for LaCie NASes (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 and 5Big Network v2) consist of a kernel and initrd for U-Boot. You can obtain these files from &lacie-kirkwood-firmware-img;.
da: Installationsfilerne for LaCie NASes (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 og 5Big Network v2) består af en kerne og initrd for U-Boot. Du kan hente disse filer fra &lacie-kirkwood-firmware-img;.

source: Armhf Multiplatform Installation Files
da: Armhf Multiplatform-installationsfiler

source: The installation files for systems supported by the armhf multiplatform kernel (see <xref linkend="armhf-armmp-supported-platforms"/>) consist of a standard Linux kernel image, a standard Linux initial ramdisk image and a system-specific device-tree blob. The kernel and the initial ramdisk image for tftp-booting can be obtained from &armmp-firmware-img; and the device-tree blob can be obtained from &armmp-dtb-img;. The tar archive for creating a bootable USB stick with the installer can be obtained from &armmp-hd-media-tarball;.
da: Installationsfilerne for systemer understøttet af armhf multiplatform-kernen (se <xref linkend="armhf-armmp-supported-platforms"/>) består af et standardaftryk for Linuxkernen, et standardaftryk for Linux initial ramdisk og en systemspecifik enhedstræ-blob. Kernen og initial ramdisk-aftrykket kan hentes fra &armmp-firmware-img; og enhedstræ-blob'en kan hentes fra &armmp-dtb-img;. Tar-arkivet til oprettelse af et USB-drev, der kan startes op fra, med installationsprogrammet kan hentes fra &armmp-hd-media-tarball;.

source: Creating Floppies from Disk Images
da: Oprette disketter fra diskaftryk

source: Bootable floppy disks are generally used as a last resort to boot the installer on hardware that cannot boot from CD or by other means.
da: Opstartsbare disketter bruges generelt som en sidste mulighed til at starte installationsprogrammet op, på udstyr som ikke kan starte fra cd eller ved andre metoder.

source: Booting the installer from floppy disk reportedly fails on Mac USB floppy drives.
da: Opstart af installationsprogrammet fra diskettedrev fejler på Mac USB-diskettedrev.

source: Disk images are files containing the complete contents of a floppy disk in <emphasis>raw</emphasis> form. Disk images, such as <filename>boot.img</filename>, cannot simply be copied to floppy drives. A special program is used to write the image files to floppy disk in <emphasis>raw</emphasis> mode. This is required because these images are raw representations of the disk; it is required to do a <emphasis>sector copy</emphasis> of the data from the file onto the floppy.
da: Diskaftryk er filer, der indeholder hele indholdet af en diskette i <emphasis>rå</emphasis> form. Diskaftryk, såsom <filename>boot.img</filename>, kan ikke bare kopieres til diskettedrev. Et speciel program bruges til at skrive aftryksfilerne til diskettedrev i <emphasis>rå</emphasis> tilstand. Dette er krævet da disse aftryk er rå repræsentationer af disken; det er krævet, at der udføres en <emphasis>sektorkopiering</emphasis> af dataene fra filen til disketten.

source: There are different techniques for creating floppies from disk images. This section describes how to create floppies from disk images on different platforms.
da: Der er forskellige teknikker for oprettelse af disketter fra diskaftryk. Dette afsnit beskriver hvordan der oprettes disketter fra diskaftryk på forskellige platforme.

source: Before you can create the floppies, you will first need to download them from one of the &debian; mirrors, as explained in <xref linkend="downloading-files"/>. <phrase arch="i386">If you already have an installation CD-ROM or DVD, the floppy images may also be included on the CD/DVD.</phrase>
da: Før du kan oprette disketterne, så skal du først hente dem fra en af &debian;-spejlene, som forklaret i <xref linkend="downloading-files"/>. <phrase arch="i386">Hvis du allerede har en installations-cd-rom eller dvd, så an disketteaftrykken også være inkluderet på cd'en eller dvd'en.</phrase>

source: No matter which method you use to create your floppies, you should remember to flip the write-protect tab on the floppies once you have written them, to ensure they are not damaged unintentionally.
da: Uanset hvilken metode du ønsker at bruge til at oprette disketterne med, så bør du huske at indstille skrivebeskyttelsesknappen på disketterne, når du har skrevet til dem, så de ikke uagtsomt bliver beskadiget.

source: Writing Disk Images From a Linux or Unix System
da: Skrivning af diskaftryk fra et Linux- eller Unix-system

source: To write the floppy disk image files to the floppy disks, you will probably need root access to the system. Place a good, blank floppy in the floppy drive. Next, use the command <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> where <replaceable>filename</replaceable> is one of the floppy disk image files. <filename>/dev/fd0</filename> is a commonly used name of the floppy disk device, it may be different on your workstation<phrase arch="sparc"> (on Solaris, it is <filename>/dev/fd/0</filename>)</phrase>. The command may return to the prompt before Unix has finished writing the floppy disk, so look for the disk-in-use light on the floppy drive and be sure that the light is out and the disk has stopped revolving before you remove it from the drive. On some systems, you'll have to run a command to eject the floppy from the drive <phrase arch="sparc"> (on Solaris, use <command>eject</command>, see the manual page)</phrase>.
da: For at skrive disketteaftryksfiler til disketter, så skal du sandsynligvis have administratoradgang til systemet. Placer en god, tom diskette i diskettedrevet. Brug kommandoen <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> hvor <replaceable>filnavn</replaceable> er et af disketteaftryksfilerne. <filename>/dev/fd0</filename> er et ofte anvendt navn for diskettedrevet, det kan være anderledes på din arbejdsstation<phrase arch="sparc"> (på Solaris, er det <filename>/dev/fd/0</filename>)</phrase>. Kommandoen kan returnere til prompten før Unix er færdig med at skrive til disketten, så kig efter lyset for disketten er i brug på diskettedrevet og vær sikker på, at det er slukket og disketten er stoppet med at rotere før du fjerner den fra drevet. På nogle systemer, skal du køre en kommando for at skubbe disketten ud fra drevet <phrase arch="sparc"> (på Solaris, brug <command>eject</command>, se manualsiden)</phrase>.

source: Some systems attempt to automatically mount a floppy disk when you place it in the drive. You might have to disable this feature before the workstation will allow you to write a floppy in <emphasis>raw mode</emphasis>. Unfortunately, how to accomplish this will vary based on your operating system. <phrase arch="sparc"> On Solaris, you can work around volume management to get raw access to the floppy. First, make sure that the floppy is auto-mounted (using <command>volcheck</command> or the equivalent command in the file manager). Then use a <command>dd</command> command of the form given above, just replace <filename>/dev/fd0</filename> with <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>, where <replaceable>floppy_name</replaceable> is the name the floppy disk was given when it was formatted (unnamed floppies default to the name <filename>unnamed_floppy</filename>). On other systems, ask your system administrator. </phrase>
da: Nogle systemer forsøger automatisk at montere et diskettedrev, når du placerer den i drevet. Du skal måske deaktivere denne funktion, før arbejdsstationen vil give dig rettighed til at skrive en diskette i <emphasis>rå tilstand</emphasis>. Desværre vil metoden til at opnå dette variere med dit operativsystem. <phrase arch="sparc"> På Solaris kan du arbejde dig omkring diskenhedshåndtering for at få rå adgang til disketten. Først skal du sikre dig, at disketten er automatisk monteret (via <command>volcheck</command> eller den tilsvarende kommando i filhåndteringen). Brug så kommandoen <command>dd</command> i formen angivet ovenfor, bare erstat <filename>/dev/fd0</filename> med <filename>/vol/rdsk/<replaceable>diskettenavn</replaceable></filename>, hvor <replaceable>diskettenavn</replaceable> er navnet som disketten fik, da den blev formateret (unavngivne disketter får navnet <filename>unnamed_floppy</filename>). På andre systemer, skal du spørge din systemadministrator. </phrase>

source: If writing a floppy on powerpc Linux, you will need to eject it. The <command>eject</command> program handles this nicely; you might need to install it.
da: Hvis du skriver til en diskette på powerpc-linux, så skal du skubbe den ud. Programmet <command>eject</command> håndterer dette pænt; du skal måske installere det.

source: Writing Disk Images From DOS, Windows, or OS/2
da: Skrivning af diskaftryk fra DOS, Windwos eller OS/2

source: If you have access to an i386 or amd64 machine, you can use one of the following programs to copy images to floppies.
da: Hvis du adgang til en i386- eller amd64-maskine, så kan du bruge en af de følgende programmer til at kopiere aftryk til disketter.

source: The <command>rawrite1</command> and <command>rawrite2</command> programs can be used under MS-DOS. To use these programs, first make sure that you are booted into DOS. Trying to use these programs from within a DOS box in Windows, or double-clicking on these programs from the Windows Explorer is <emphasis>not</emphasis> expected to work.
da: Programmerne <command>rawrite1</command> og <command>rawrite2</command> kan bruges under MS-DOS. For at bruge disse programmer skal du først sikre dig, at du er startet i DOS. At bruge disse programmer inden fra en DOS-boks i Windows, eller dobbeltklik på disse programmer fra Windows Explorer kan <emphasis>ikke</emphasis> forventes at fungere.

source: The <command>rwwrtwin</command> program runs on Windows 95, NT, 98, 2000, ME, XP and probably later versions. To use it you will need to unpack diskio.dll in the same directory.
da: Programmet <command>rwwrtwin</command> kører på Windows 95, NT, 98, 2000, ME, XP og sandsynligvis senere versioner. For at bruge programmet skal du udpakke diskio.dll i den samme mappe.

source: These tools can be found on the Official &debian; CD-ROMs under the <filename>/tools</filename> directory.
da: Disse værktøjer kan findes på de officielle &debian;-cd-rom'er under mappen <filename>/tools</filename>.

source: Writing Disk Images From MacOS
da: Skrivning af diskaftryk fra MacOS

source: An AppleScript, <application>Make &debian; Floppy</application>, is available for burning floppies from the provided disk image files. It can be downloaded from <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. To use it, just unstuff it on your desktop, and then drag any floppy image file to it. You must have Applescript installed and enabled in your extensions manager. Disk Copy will ask you to confirm that you wish to erase the floppy and proceed to write the file image to it.
da: Et Applescript, <application>Make &debian; Floppy</application>, er tilgængelig for brænding af disketteaftryk fra de tilbudte diskaftryksfiler. Det kan hentes fra <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. For at bruge det, så »unstuff« det på dit skrivebord, og træk så disketteaftryksfilen til det. Du skal have Applescript installeret og aktiveret i din udvidelseshåndtering. Disk Copy vil bede dig om at bekræfte, at du ønsker at slette disketten og fortsætte med at skrive filaftrykket.

source: You can also use the MacOS utility <command>Disk Copy</command> directly, or the freeware utility <command>suntar</command>. The <filename>root.bin</filename> file is an example of a floppy image. Use one of the following methods to create a floppy from the floppy image with these utilities.
da: Du kan også bruge MacOS-redskabet <command>Disk Copy</command> direkte, eller freeware-redskabet <command>suntar</command>. Filen <filename>root.bin</filename> er et eksempel på et disketteaftryk. Brug en af de følgende metoder til at oprette en diskette fra disketteaftrykket med disse redskaber.

source: Writing Disk Images with <command>Disk Copy</command>
da: Skrivning af diskaftryk med <command>Disk Copy</command>

source: If you are creating the floppy image from files which were originally on the official &debian-gnu; CD, then the Type and Creator are already set correctly. The following <command>Creator-Changer</command> steps are only necessary if you downloaded the image files from a &debian; mirror.
da: Hvis du opretter diskaftrykket fra filer, som oprindelig befandt sig på den officielle &debian-gnu;-cd, så er Type og Creator allerede angivet korrekt. De følgende <command>Creator-Changer</command>-trin er kun nødvendige hvis du hentede aftryksfilerne fra et &debian;-spejl.

source: Obtain <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> and use it to open the <filename>root.bin</filename> file.
da: Hent <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> og brug den til at åbne filen <filename>root.bin</filename>.

source: Change the Creator to <userinput>ddsk</userinput> (Disk Copy), and the Type to <userinput>DDim</userinput> (binary floppy image). The case is sensitive for these fields.
da: Ændr Creator til <userinput>ddsk</userinput> (Disk Copy), og Type til <userinput>DDim</userinput> (binært disketteaftryk). Der er forskel på små og store bogstaver for disse felter.

source: <emphasis>Important:</emphasis> In the Finder, use <userinput>Get Info</userinput> to display the Finder information about the floppy image, and <quote>X</quote> the <userinput>File Locked</userinput> check box so that MacOS will be unable to remove the boot blocks if the image is accidentally mounted.
da: <emphasis>Vigtigt:</emphasis> I Finder, brug <userinput>Get Info</userinput> for at vise Finder-informationen om disketteaftrykket, og afkryds <quote>X</quote> <userinput>File Locked</userinput>-afkrydsningsboksen så at MacOS ikke kan fjerne opstartsblokken hvis aftrykket ved en fejl monteres.

source: Obtain <command>Disk Copy</command>; if you have a MacOS system or CD it will very likely be there already, otherwise try <ulink url="&url-powerpc-diskcopy;"></ulink>.
da: Hent <command>Disk Copy</command>; hvis du har et MacOS-system eller cd så vil programmet højst sandsynlig allerede være installeret, ellers prøv <ulink url="&url-powerpc-diskcopy;"></ulink>.
