Repository: bipulkumar7/DebianInstaller
Catalog: manual/po/*/install-methods.po
Languages: da

source: There are two BOOTP servers available for GNU/Linux. The first is CMU <command>bootpd</command>. The other is actually a DHCP server: ISC <command>dhcpd</command>. In &debian-gnu; these are contained in the <classname>bootp</classname> and <classname>isc-dhcp-server</classname> packages respectively.
da: Der er to BOOTP-servere tilgængelige for GNU/Linux. Den første er CMU <command>bootpd</command>. Den anden er faktisk en DHCP-server: ISC <command>dhcpd</command>. I &debian-gnu; er disse indeholdt i pakkerne <classname>bootp</classname> og <classname>isc-dhcp-server</classname> respektivt.

source: To use CMU <command>bootpd</command>, you must first uncomment (or add) the relevant line in <filename>/etc/inetd.conf</filename>. On &debian-gnu;, you can run <userinput>update-inetd --enable bootps</userinput>, then <userinput>/etc/init.d/inetd reload</userinput> to do so. Just in case your BOOTP server does not run &debian;, the line in question should look like: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Now, you must create an <filename>/etc/bootptab</filename> file. This has the same sort of familiar and cryptic format as the good old BSD <filename>printcap</filename>, <filename>termcap</filename>, and <filename>disktab</filename> files. See the <filename>bootptab</filename> manual page for more information. For CMU <command>bootpd</command>, you will need to know the hardware (MAC) address of the client. Here is an example <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> You will need to change at least the <quote>ha</quote> option, which specifies the hardware address of the client. The <quote>bf</quote> option specifies the file a client should retrieve via TFTP; see <xref linkend="tftp-images"/> for more details. <phrase arch="mips"> On SGI machines you can just enter the command monitor and type <userinput>printenv</userinput>. The value of the <userinput>eaddr</userinput> variable is the machine's MAC address. </phrase>
da: For at bruge CMU <command>bootpd</command>, skal du først aktivere (eller tilføje) de relevante linjer i <filename>/etc/inetd.conf</filename>. På &debian-gnu; kan du køre <userinput>update-inetd --enable bootps</userinput>, og så <userinput>/etc/init.d/inetd reload</userinput> for at gøre det. Bare i tilfælde af, at din BOOTP-server ikke kører &debian;, skal den omtalte linje se således ud:<informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Nu skal du oprette en <filename>/etc/bootptab</filename>-fil. Den har samme slags kendte og kryptiske format som det gode gamle BSD <filename>printcap</filename>-, <filename>termcap</filename>-, og <filename>disktab</filename>-filer. Se manualsiden <filename>bootptab</filename> for yderligere information. For CMU <command>bootpd</command>, skal du bruge udstyrsadressen (MAC) for klienten. Her er en eksempel <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> Du skal mindst ændre <quote>ha</quote>-tilvalget, som angiver udstyrsadressen for klienten. Tilvalget <quote>bf</quote> specificerer filen en klient skal hente via TFTP; se <xref linkend="tftp-images"/> for yderligere detaljer. <phrase arch="mips"> På SGI-maskiner kan du bare gå i kommandoskærmen og indtaste <userinput>printenv</userinput>. Værdien for variablen <userinput>eaddr</userinput> er maskinens MAC-adresse. </phrase>

source: By contrast, setting up BOOTP with ISC <command>dhcpd</command> is really easy, because it treats BOOTP clients as a moderately special case of DHCP clients. Some architectures require a complex configuration for booting clients via BOOTP. If yours is one of those, read the section <xref linkend="dhcpd"/>. Otherwise you will probably be able to get away with simply adding the <userinput>allow bootp</userinput> directive to the configuration block for the subnet containing the client in <filename>/etc/dhcp/dhcpd.conf</filename>, and restart <command>dhcpd</command> with <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.
da: Som kontrast er opsætning af BOOTP med ISC <command>dhcpd</command> virkelig nemt, da det opfatter BOOTP-klienter som et moderat specieltilfælde for DHCP-klienter. Nogle arkitekturer kræver en kompleks konfiguration for opstart af klienter via BOOTP. Hvis din er en af disse, så læs afsnittet <xref linkend="dhcpd"/>. Ellers vil du sandsynligvis kunne slippe af sted med at tilføje <userinput>allow bootp</userinput> direkte til konfigurationsblokken for undernettet, der indeholder klienten i <filename>/etc/dhcp/dhcpd.conf</filename>, og genstarte <command>dhcpd</command> med <userinput>/etc/init.d/isc-dhcp-server restart</userinput>.

source: Enabling the TFTP Server
da: Aktivering af TFTP-serveren

source: To get the TFTP server ready to go, you should first make sure that <command>tftpd</command> is enabled.
da: For at få TFTP-serveren klar, skal du først sikre dig, at <command>tftpd</command> er aktiveret.

source: In the case of <classname>tftpd-hpa</classname> there are two ways the service can be run. It can be started on demand by the system's <classname>inetd</classname> daemon, or it can be set up to run as an independent daemon. Which of these methods is used is selected when the package is installed and can be changed by reconfiguring the package.
da: I tilfældet <classname>tftpd-hpa</classname> er der to måder at tjenesten kan køres. Den kan startes efter behov af systemets dæmon <classname>inetd</classname>, eller den kan opsættes til at blive kørt som en uafhængig dæmon. Hvilken af disse metoder der bruges vælges når pakke installeres og kan ændres ved at rekonfigurere pakken.

source: Historically, TFTP servers used <filename>/tftpboot</filename> as directory to serve images from. However, &debian-gnu; packages may use other directories to comply with the <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. For example, <classname>tftpd-hpa</classname> by default uses <filename>/srv/tftp</filename>. You may have to adjust the configuration examples in this section accordingly.
da: Historisk brugte TFTP-servere <filename>/tftpboot</filename> som mappe til at betjene aftryk fra. Pakkerne &debian-gnu; kan bruge andre mapper til at overholde <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink>. For eksempel bruger <classname>tftpd-hpa</classname> som standard <filename>/srv/tftp</filename>. Du skal måske justere konfigurationseksemplerne i dette afsnit jævnfør dette.

source: All <command>in.tftpd</command> alternatives available in &debian; should log TFTP requests to the system logs by default. Some of them support a <userinput>-v</userinput> argument to increase verbosity. It is recommended to check these log messages in case of boot problems as they are a good starting point for diagnosing the cause of errors.
da: Alle <command>in.tftpd</command> alternativer tilgængelige i &debian; bør logge TFTP-forespørgsler til systemets logge som standard. Nogle af dem understøtter et <userinput>-v</userinput> argument for at øge uddybningen. Det anbefales at kontrollere disse logbeskeder i tilfælde at opstartsproblemer, da de er et godt udgangspunkt for diagnosticering af fejltilfælde.

source: If you intend to install &debian; on an SGI machine and your TFTP server is a GNU/Linux box running Linux 2.4, you'll need to set the following on your server: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> to turn off Path MTU discovery, otherwise the SGI's PROM can't download the kernel. Furthermore, make sure TFTP packets are sent from a source port no greater than 32767, or the download will stall after the first packet. Again, it's Linux 2.4.X tripping this bug in the PROM, and you can avoid it by setting <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> to adjust the range of source ports the Linux TFTP server uses.
da: Hvis du planlægger at installere &debian; på en SGI-maskine og din TFTP-server er en GNU/Linux-boks, der kører Linux 2.4, så skal du angive det følgende på din server: nux box running Linux 2.4, you'll need to set the following on your server: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> for at deaktivere Path MTU-registrering, ellers kan SGI's PROM ikke hente kernen. Derudover skal du sikre dig, at TFTP-pakker sendes fra en kildeport, der ikke er højere end 32767, ellers vil overførslen stoppe efter den første pakke. Igen det er Linux 2.4.x der udløser denne fejl i PROM'en, og du kan undgå den ved at angive <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> for at justere intervallet af kildeporte som Linux TFTP-serveren bruger.

source: Move TFTP Images Into Place
da: Flyt TFTP-aftryk på plads

source: Next, place the TFTP boot image you need, as found in <xref linkend="where-files"/>, in the <command>tftpd</command> boot image directory. You may have to make a link from that file to the file which <command>tftpd</command> will use for booting a particular client. Unfortunately, the file name is determined by the TFTP client, and there are no strong standards.
da: Placer så TFTP-opstartsaftrykket du skal bruge som set i <xref linkend="where-files"/>, i opstartsaftryksmappen <command>tftpd</command>. Du skal måske lave en henvisning fra den fil til filen som <command>tftpd</command> vil bruge til opstart af en bestemt klient. Desværre bestemmes filnavnet af TFTP-klienten, og der er ingen udbredte standarder.

source: On NewWorld Power Macintosh machines, you will need to set up the <command>yaboot</command> boot loader as the TFTP boot image. <command>Yaboot</command> will then retrieve the kernel and RAMdisk images via TFTP itself. You will need to download the following files from the <filename>netboot/</filename> directory:
da: På NewWorld Power Macintosh-maskiner skal du opsætte opstartsindlæseren <command>yaboot</command> som TFTP-opstartsaftryk. <command>Yaboot</command> vil selv hente kernen og RAMdisk-aftryk via TFTP. Du skal hente de følgende filer fra mappen <filename>netboot/</filename>:

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>pxelinux.0</filename> to <command>tftpd</command> as the filename to boot.
da: For PXE-opstart befinder alt du bør sætte op sig i tarball'en <filename>netboot/netboot.tar.gz</filename>. Udpak denne tarbal i mappen for opstartsaftrykket <command>tftpd</command>. Sikr dig at din dhcp-server er konfigureret til at sende <filename>pxelinux.0</filename> til <command>tftpd</command> som filnavnet at starte op.

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>/debian-installer/ia64/elilo.efi</filename> to <command>tftpd</command> as the filename to boot.
da: For PXE-opstart befinder alt du bør sætte op sig i tarball'en <filename>netboot/netboot.tar.gz</filename>. Udpak denne tarbal i mappen for opstartsaftrykket <command>tftpd</command>. Sikr dig at din dhcp-server er konfigureret til at sende <filename>/debian-installer/ia64/elilo.efi</filename> til <command>tftpd</command> som filnavnet at starte op.

source: SPARC TFTP Booting
da: SPARC TFTP-opstart

source: Some SPARC architectures add the subarchitecture names, such as <quote>SUN4M</quote> or <quote>SUN4C</quote>, to the filename. Thus, if your system's subarchitecture is a SUN4C, and its IP is 192.168.1.3, the filename would be <filename>C0A80103.SUN4C</filename>. However, there are also subarchitectures where the file the client looks for is just <filename>client-ip-in-hex</filename>. An easy way to determine the hexadecimal code for the IP address is to enter the following command in a shell (assuming the machine's intended IP is 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> To get to the correct filename, you will need to change all letters to uppercase and if necessary append the subarchitecture name.
da: Nogle SPARC-arkitekturer tilføjer underarkitekturnavne, såsom <quote>SUN4M</quote> eller <quote>SUN4C</quote>, til filnavnet. Hvis dit systems underarkitektur er en SUN4c, og dets IP er 192.168.1.3, vil filnavnet være <filename>C0A80103.SUN4C</filename>. Men der er også underarkitekturer hvor filen klienten kigger efter kun er <filename>client-ip-in-hex</filename>. En nem måde at bestemme den hexadecimale kode for IP-adressen er at indtaste den følgende kommando i en skal (under antagelse af at maskinens forventede IP er 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> For at hente det korrekte filnavn, så skal du ændre alle bogstaverne til store bogstaver og om nødvendigt tilføje underarkitekturnavnet.

source: If you've done all this correctly, giving the command <userinput>boot net</userinput> from the OpenPROM should load the image. If the image cannot be found, try checking the logs on your tftp server to see which image name is being requested.
da: Hvis du har gjort alt dette korrekt, vil kommandoen <userinput>boot net</userinput> fra OpenPROM indlæse aftrykket. Hvis aftrykket ikke kan findes, så prøv at kontrollere loggene på din tftp-server for at se hvilket aftryksnavn der anmodes om.

source: You can also force some sparc systems to look for a specific file name by adding it to the end of the OpenPROM boot command, such as <userinput>boot net my-sparc.image</userinput>. This must still reside in the directory that the TFTP server looks in.
da: Du kan også fremtvinge nogle sparc-systemer til at kigge efter et specifikt filnavn ved at tilføjet det til slutningen af OpenPROM-opstartskommandoen, såsom <userinput>boot net my-sparc.image</userinput>. Dette skal stadig befinde sig i mappen som TFTP-serveren kigger i.

source: SGI TFTP Booting
da: SGI TFTP-opstart

source: On SGI machines you can rely on the <command>bootpd</command> to supply the name of the TFTP file. It is given either as the <userinput>bf=</userinput> in <filename>/etc/bootptab</filename> or as the <userinput>filename=</userinput> option in <filename>/etc/dhcpd.conf</filename>.
da: På SGI-maskiner kan du stole på <command>bootpd</command> for at levere navnet på TFTP-filen. Den angives enten som <userinput>bf=</userinput> i <filename>/etc/bootptab</filename> eller som <userinput>filename=</userinput>-tlvalget i <filename>/etc/dhcpd.conf</filename>.

source: Automatic Installation
da: Automatisk installation

source: For installing on multiple computers it's possible to do fully automatic installations. &debian; packages intended for this include <classname>fai-quickstart</classname> (which can use an install server) and the &debian; Installer itself. Have a look at the <ulink url="http://fai-project.org">FAI home page</ulink> for detailed information.
da: For installation på flere computere er det muligt at udføre helt automatiske installationer. &debian;-pakker til dette formål inkluderer <classname>fai-quickstart</classname> (som kan bruge en installationsserver) og selve &debian;-installationsprogrammet. Kig på <ulink url="http://fai-project.org">FAI's hjemmeside</ulink> for detaljeret information.

source: Automatic Installation Using the &debian; Installer
da: Automatisk installation med &debian;-installationsprogrammet

source: The &debian; Installer supports automating installs via preconfiguration files. A preconfiguration file can be loaded from the network or from removable media, and used to fill in answers to questions asked during the installation process.
da: &debian;-installationsprogrammet understøtter automatiske installationer via prækonfigurationsfiler. En prækonfigurationsfil kan indlæses fra netværket eller fra et eksternt medie, og bruges til at udfylde svar på spørgsmål stillet under installationsprocessen.

source: Full documentation on preseeding including a working example that you can edit is in <xref linkend="appendix-preseed"/>.
da: Fuld dokumentation vedrørende preseeding inklusiv et arbejdseksempel, som du kan redigere er i <xref linkend="appendix-preseed"/>.
